Revit 2024 API
TrussType Class
Represents a specific type of truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class TrussType : FamilySymbol
Visual Basic
Public Class TrussType _
	Inherits FamilySymbol
Visual C++
public ref class TrussType : public FamilySymbol
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.Structure.TrussType
See Also
TrussType Members
Autodesk.Revit.DB.Structure Namespace